__author__ = 'Нестеренко Александр'
# Задание 1. Выяснить тип результата выражений:
# 15 * 3
# 15 / 3
# 15 // 2
# 15 ** 2

print(type(15 * 3))
print(type(15 / 3))
print(type(15 // 3))
print(type(15 ** 3))
